model_expose/test_wrk.txt
2 threads and 50000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   479.12ms  158.81ms   1.13s    76.03%
    Req/Sec   132.01     80.43   474.00     62.57%
  11641 requests in 45.03s, 4.31MB read
  Socket errors: connect 48981, read 0, write 0, timeout 0
  Non-2xx or 3xx responses: 11641
Requests/sec:    258.53
Transfer/sec:     97.96KB